/*
					*** 24C02_头文件 ***
| 适配硬件:| HL-1开发板
===========================================================*/

#ifndef __24C02_H__
#define __24C02_H__

/******* 宏定义 *******/

/****** 引脚定义 ******/

/****** 变量声明 ******/

/****** 函数声明 ******/
void delay10ms();							//延时10ms
void iic_Write_dat(u8, u8, u8);				//字节写操作向24C02写入一个字节数据
u8 iic_read_dat(u8, u8);					//字节读操作从24C02读取一个字节数据
void iic_write_page(u8, u8, u8 *, u8);		//页写操作往24c02连续写入n个字节数据(可跨页,n可大于8)
void iic_read_page(u8, u8, u8 *, u8);		//页读操作从24c02连续读取n个字节数据(n可大于8)
	
#endif