/*
					*** 菜单设置_c文件 ***
| 适配硬件:| HL-1开发板
===========================================================*/

#include "public.h"

/***** 变量声明或定义 *****/
bit flag_keyAc = 0;			//按键动作标志位，只要有按键动作，该标志位置1，保存并退出菜单时清0
u8 page = 1;
u8 mLayer = 0;
u8 arrowPos1 = 1;

extern void StartScreen();

/***********************************************************|
| 名称	:| 一级菜单页显示
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void menu1()
{
	switch (page)
	{
		case 1:
			lcd12864_show_str(1, 1, "1.项目A");				//显示第二行内容
			lcd12864_show_str(1, 2, "2.项目B");				//显示第三行内容
			lcd12864_show_str(1, 3, "3.项目C");				//显示第四行内容
			break;
		case 2:
			lcd12864_show_str(1, 1, "4.项目D");				//显示第二行内容
			lcd12864_show_str(1, 2, "5.项目E");				//显示第三行内容
			lcd12864_show_str(1, 3, "6.项目F");				//显示第四行内容
			break;
		case 3:
			lcd12864_show_str(1, 1, "7.项目G");				//显示第二行内容
			lcd12864_show_str(1, 2, "8.项目H");				//显示第三行内容
			lcd12864_clear_str(1, 3, 6);					//清除上页该行的6个汉字字符位
			break;
		default:
			break;
	}
}


/***********************************************************|
| 名称	:| 显示箭头位置
| 参数	:| u8 arrowPos	-要显示页面指向箭头位置
| 返回值	:| 无
/***********************************************************/
void arrow_position(u8 arrowPos)
{			
	if ((arrowPos == 1) || (arrowPos == 4) || (arrowPos == 7))			//当菜单标题1、4、7都是在屏幕第二行显示时
	{
		lcd12864_set_cursor(0, 1);										//设置地址在第二行第一个字符处
	}
	else if ((arrowPos == 2) || (arrowPos == 5) || (arrowPos == 8))		//当菜单标题2、5、8都是在屏幕第三行显示时
	{
		lcd12864_set_cursor(0, 2);										//设置地址在第三行第一个字符处
	}
	else if ((arrowPos == 3) || (arrowPos == 6))						//当菜单标题3、6都是在屏幕第四行显示时
	{
		lcd12864_set_cursor(0, 3);										//设置地址在第四行第一个字符处
	}
	lcd12864_write_dat(' ');											//左半角英文字符位显示空格
	lcd12864_write_dat(0x10);											//右半角英文字符位显示左箭头
}


/***********************************************************|
| 描述	:| 菜单显示
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void show_menu()
{
	if (mLayer == 1)								//当菜单层变量为1时
	{
		menu1();									//刷新显示一级菜单
	}
	else if (mLayer == 2)							//当菜单层变量为2时
	{
		switch (arrowPos1)							//根据箭头指向位置，刷新显示不同的二级菜单
		{			
			case 1: menu11(); break;				//刷新显示一级菜单项目1下的二级菜单
			case 2: menu12(); break;				//刷新显示一级菜单项目2下的二级菜单
			case 3: menu13(); break;				//刷新显示一级菜单项目3下的二级菜单
			case 4: menu14(); break;				//刷新显示一级菜单项目4下的二级菜单
			case 5: menu15(); break;				//刷新显示一级菜单项目5下的二级菜单
			case 6: menu16(); break;				//刷新显示一级菜单项目6下的二级菜单
			case 7: menu17(); break;				//刷新显示一级菜单项目7下的二级菜单
			case 8: menu18(); break;				//刷新显示一级菜单项目8下的二级菜单
			default: break;
		}	
	}
}


/***********************************************************|
| 描述	:| 改变菜单页码
| 参数1	:| u8 arrowPos	-指向箭头位置
| 参数2	:| 无
| 返回值	:| 无
/***********************************************************/
void menu_page(u8 arrowPos)
{
	if ((arrowPos >= 1) && (arrowPos <= 3) )			//当箭头位置为1-3时
	{
		page = 1;										//菜单层数置为2
	}
	else if ((arrowPos >= 4) && (arrowPos <= 6) )		//当箭头位置为4-6时
	{
		page = 2;										//菜单层数置为2
	}
	else if ((arrowPos >= 7) && (arrowPos <= 8) )		//当箭头位置为7-8时
	{
		page = 3;										//菜单层数置为3
	}
}


/***********************************************************|
| 描述	:| 刷新菜单上翻页显示
| 参数1	:| u8 arrowPos	-指向箭头位置
| 参数2	:| u8 posMax	-箭头位置最大值
| 返回值	:| 无
/***********************************************************/
void refresh_menuUp(u8 arrowPos, u8 posMax)
{
	if ((arrowPos == 3) || (arrowPos == 6) ||  (arrowPos == posMax))	//当箭头位置为3/6/最大值时
	{
		show_menu();		//显示菜单		
	}
}


/***********************************************************|
| 描述	:| 刷新菜单下翻页显示
| 参数1	:| u8 arrowPos	-指向箭头位置
| 参数2	:| u8 posMax	-箭头位置最大值
| 返回值	:| 无
/***********************************************************/
void refresh_menuDown(u8 arrowPos)
{
	if ((arrowPos == 1) || (arrowPos == 4) ||  (arrowPos == 7))		//当箭头位置为1/4/7时
	{
		show_menu();		//显示菜单		
	}
}


/***********************************************************|
| 名称	:| 清除箭头显示
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void clear_arrow()
{
	lcd12864_show_str(0, 1, "  ");					//清除屏幕第二行最左边箭头显示区域
	lcd12864_show_str(0, 2, "  ");					//清除屏幕第三行最左边箭头显示区域
	lcd12864_show_str(0, 3, "  ");					//清除屏幕第四行最左边箭头显示区域
}


/***********************************************************|
| 名称	:| 指向箭头上移显示
| 参数1	:| u8 arrowPos	-当面界面箭头位置索引
| 参数2	:| u8 posMax	-箭头位置索引最大值
| 返回值	:| 无
/***********************************************************/
void arrow_moveUp(u8 *paPos, u8 posMax)
{
	if (*paPos != 0)
	{
		if (*paPos > 1)						//如果箭头位置大于1
		{
			(*paPos)--;						//箭头位置-1
		}
		else								//当箭头位置-到小于1时
		{
			*paPos = posMax;				//将箭头位置值置为最大值
		}
				
		menu_page(*paPos);					//改变菜单页码(这两句必须在下两句前面，否则翻页后箭头不显示)
		refresh_menuUp(*paPos, posMax);		//刷新菜单上翻页显示	
		
		clear_arrow();						//清除按键上次动作显示的箭头		
		arrow_position(*paPos);				//调用箭头位置，刷新显示箭头
	}
}


/***********************************************************|
| 名称	:| 指向箭头下移显示
| 参数1	:| u8 arrowPos	-当面界面箭头位置索引
| 参数2	:| u8 posMax	-箭头位置索引最大值
| 返回值	:| 无
/***********************************************************/
void arrow_moveDown(u8 *paPos, u8 posMax)
{
	if (*paPos != 0)
	{
		if (*paPos < posMax)			//如果箭头位置小于最大值
		{
			(*paPos)++;					//箭头位置+1
		}
		else							//当箭头位置-到小于1时
		{
			*paPos = 1;					//将箭头位置值置为1
		}
				
		menu_page(*paPos);				//改变菜单页码(这两句必须在下两句前面，否则翻页后箭头不显示)
		refresh_menuDown(*paPos);		//刷新菜单下翻页显示

		clear_arrow();					//清除按键上次动作显示的箭头		
		arrow_position(*paPos);			//刷新显示箭头
	}
}


/***********************************************************|
| 名称	:| 上按键单击程序
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void up_key()
{
	if (mLayer != 0)						//菜单层不为0，即在设置状态
	{
		if (mLayer == 1)							//如果菜单层为1时
		{
			arrow_moveUp(&arrowPos1, 8);			//执行一级菜单的的箭头上移选择
		}
		else if (mLayer == 2)						//如果菜单层为2时
		{
			switch (arrowPos1)						//根据一级菜单的箭头位置，选择下面对应的二级菜单上移
			{
				case 1: arrow_moveUp(&arrowPos11, 8); break;		//子项1下移选择
				case 2: arrow_moveUp(&arrowPos12, 8); break;		//子项2下移选择
				case 3: arrow_moveUp(&arrowPos13, 8); break;		//子项3下移选择
				case 4: arrow_moveUp(&arrowPos14, 8); break;		//子项4下移选择
				case 5: arrow_moveUp(&arrowPos15, 8); break;		//子项5下移选择
				case 6: arrow_moveUp(&arrowPos16, 8); break;		//子项6下移选择
				case 7: arrow_moveUp(&arrowPos17, 8); break;		//子项7下移选择
				case 8: arrow_moveUp(&arrowPos18, 8); break;		//子项8下移选择
				default: break;
			}
		}
		else if (mLayer == 3)
		{
			add_dat();								//菜单层为3时，就在设置项里递增数据
		}
	}
}


/***********************************************************|
| 名称	:| 上按键持续按下程序
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void up_keyHold()
{
	if (mLayer == 3)
	{
		add_dat();
	}
}


/***********************************************************|
| 名称	:| 下按键单击程序
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void down_key()
{
	if (mLayer != 0)						//菜单层不为0，即在设置状态
	{
		if (mLayer == 1)							//如果菜单层为1时
		{
			arrow_moveDown(&arrowPos1, 8);			//执行一级菜单的的箭头下移选择
		}
		else if (mLayer == 2)						//如果菜单层为2时
		{
			switch (arrowPos1)								//根据一级菜单的箭头位置，选择下面对应的二级菜单下移
			{
				case 1: arrow_moveDown(&arrowPos11, 8); break;		//子项1下移选择
				case 2: arrow_moveDown(&arrowPos12, 8); break;		//子项2下移选择
				case 3: arrow_moveDown(&arrowPos13, 8); break;		//子项3下移选择
				case 4: arrow_moveDown(&arrowPos14, 8); break;		//子项4下移选择
				case 5: arrow_moveDown(&arrowPos15, 8); break;		//子项5下移选择
				case 6: arrow_moveDown(&arrowPos16, 8); break;		//子项6下移选择
				case 7: arrow_moveDown(&arrowPos17, 8); break;		//子项7下移选择
				case 8: arrow_moveDown(&arrowPos18, 8); break;		//子项8下移选择
				default: break;
			}
		}
		else if (mLayer == 3)
		{
			sub_dat();
		}
	}
}


/***********************************************************|
| 名称	:| 下按键持续按下程序
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void down_keyHold()
{
	if (mLayer == 3)
	{
		sub_dat();
	}
}


/***********************************************************|
| 名称	:| 进入一级菜单
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void enter_menu1()
{	
	lcd12864_clear_str(0, 1, 8);				//清除第二行字符
	lcd12864_clear_str(0, 2, 8);				//清除第三行字符
	lcd12864_clear_str(0, 3, 8);				//清除第四行字符
	lcd12864_clear_area(0, 0, 128, 16, 1);		//反白第一行显示区域
	lcd12864_show_str(1, 0, "- 一级菜单 -");		//显示第一行内容
	
	if (mLayer == 1)							//如果之前是在一级菜单层
	{		
		page = 1;								//则设置一级菜单页码1
	}	
	menu1();									//显示一级菜单
}


/***********************************************************|
| 名称	:| ENTER键长按进入设置
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void enter_set()
{
	if (mLayer == 0)
	{
		lcd12864_clear_area(1, 0, 96, 32, 0);		//清除屏幕上半屏的96*32图形区域
		mLayer = 1;									//置一级菜单层
		enter_menu1();								//进入一级菜单界面
		arrowPos1 = 1;								//设置一级菜单箭头位置为屏幕第二行
		arrow_position(arrowPos1);					//在屏幕第二行左边显示箭头
	}
	else
	{
		mLayer = 0;
		lcd12864_write_cmd(0x0C);					//关闭光标显示
		lcd12864_write_cmd(0x01);					//清零字符显示
		lcd12864_clear_area(6, 2, 32, 16, 0);		//清除2个汉字反白区域
		lcd12864_clear_area(6, 3, 32, 16, 0);		//清除2个汉字反白区域
		lcd12864_clear_area(0, 0, 128, 16, 0);		//清除第一行反白显示区域为正常显示
		StartScreen();
		flag_keyAc = 0;								//任意按键动作标志位清零
		//这里以后还有一行保存设置的语句
	}
			
}


/***********************************************************|
| 名称	:| ESC键长按退出设置
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void exit_set()
{
	mLayer = 0;									//退出菜单
	lcd12864_write_cmd(0x0C);					//关闭光标显示
	lcd12864_write_cmd(0x01);					//清零字符显示
	lcd12864_clear_area(0, 0, 128, 16, 0);		//清除第一行反白显示区域为正常显示
	lcd12864_clear_area(6, 2, 32, 16, 0);		//清除2个汉字反白区域
	lcd12864_clear_area(6, 3, 32, 16, 0);		//清除2个汉字反白区域
	StartScreen();
	flag_keyAc = 0;								//任意按键动作标志位清零
}


/***********************************************************|
| 名称	:| ESC键单击返回上级菜单
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void return_menu()
{
	if (mLayer == 2)
	{
		menu_page(arrowPos1);
		enter_menu1();								//与进入一级菜单一样处理
		arrow_position(arrowPos1);					//在屏幕第二行左边显示箭头
		mLayer = 1;			 						//置一级菜单层
	}
	else if (mLayer == 3)
	{
		lcd12864_write_cmd(0x0C);					//关闭光标显示
		lcd12864_clear_area(6, 2, 32, 16, 0);		//清除2个汉字反白区域
		lcd12864_clear_area(6, 3, 32, 16, 0);		//清除2个汉字反白区域
		clear_areaStr();							//清除屏幕2-4行字符
		menu2();
	}
}