/*
					*** 项目设置_c文件 ***
| 适配硬件:| HL-1开发板  
===========================================================*/

#include "public.h"

/***** 变量声明或定义 *****/
u8 itemIndex = 0;			//设置项目索引
u8 tmpH, tmpM, tmpS;		//定义时、分、秒缓冲区
u8 tmpY, tmpMh, tmpD;		//定义年、月、日缓冲区

/***********************************************************|
| 名称	:| 显示帮助提示
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void show_help()
{
	lcd12864_clear_area(6, 2, 32, 16, 1);		//黑色填充2个汉字字符位在第三行开始处
	lcd12864_clear_area(6, 3, 32, 16, 1);		//黑色填充2个汉字字符位在第四行开始处
	lcd12864_show_str(0, 2, "按ESC   →  退出");	//退出提示
	lcd12864_show_str(0, 3, "按ENTER →  保存");	//保存提示
}	


/***********************************************************|
| 名称	:| 一级菜单项目1下二级菜单项目1的设置项
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void menu111()
{
	lcd12864_show_str(1, 0, "* 设置时间 *");		//显示第一行内容
	lcd12864_show_str(2, 1, "时  分  秒");		//设置项内容显示第二行
	showDec_byte(1, 1, cntH);					//在屏幕第2行第2个字符处显示小时
	showDec_byte(3, 1, cntM);					//在屏幕第2行第4个字符处显示分钟
	showDec_byte(5, 1, cntS);					//在屏幕第2行第6个字符处显示秒数
	show_help();								//显示退出/保存按键提示
	itemIndex = 3;								//将设置项索引设为3
	leftKey();									//调用左键程序左移1位，正好处于分位置
	lcd12864_write_cmd(0x0F);					//开启光标显示并闪烁
}


/***********************************************************|
| 名称	:| 一级菜单项目1下二级菜单项目2的设置项
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void menu112()
{
	lcd12864_show_str(1, 0, "* 设置日期 *");		//显示第一行内容
	lcd12864_show_str(1, 1, "21年02月02日");		//设置项内容显示第三行
	show_help();								//显示退出/保存按键提示
	itemIndex = 1;								//将设置项索引设为1
	leftKey();									//调用左键程序左移1位，正好处于日位置
	lcd12864_write_cmd(0x0F);					//开启光标显示并闪烁
}


/***********************************************************|
| 名称	:| 一级菜单项目1下二级菜单项目3的设置项
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void menu113()
{
	lcd12864_show_str(1, 0, "* 设置星期 *");		//显示第一行内容
	lcd12864_show_str(2, 1, "星期");				//设置项内容显示第三行 
	show_help();								//显示退出/保存按键提示
	lcd12864_set_cursor(4, 1);					//设置光标位置在第三行第4个字符位
	lcd12864_write_cmd(0x0F);					//开启光标显示并闪烁
}


/***********************************************************|
| 名称	:| 进入项目设置界面
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void enter_setItem()
{ 
	clear_arrow();								//先清除一级菜单显示的箭头，否则后面会残留显示
	lcd12864_clear_str(0, 0, 8);				//清除第1行字符
	clear_areaStr();							//清除屏幕第2-4行字符
	
	if (arrowPos1 == 1)
	{
		switch (arrowPos11)
		{
			case 1:
				menu111();						//显示一级菜单项目1下的二级菜单第一页
				tmpH = cntH;					//读取小时数据到缓冲区
				tmpM = cntM;					//读取分钟数据到缓冲区
				tmpS = cntS;					//读取秒数据到缓冲区
				break;
			case 2:
				menu112();						//显示一级菜单项目2下的二级菜单第一页
				tmpY  = year;					//读取年份数据到缓冲区
				tmpMh = month;					//读取月份数据到缓冲区
				tmpD  = day;					//读取日期据到缓冲区
				break;
			case 3: menu113(); break;			//显示一级菜单项目2下的二级菜单第一页
			default: break;
		}
	}
	
	mLayer = 3;									//将菜单层索引改为3	
}


/***********************************************************|
| 描述	:| 刷新设置项光标显示
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void item_select()
{
	switch (itemIndex)
	{
		case 1: lcd12864_set_cursor(1, 1); break;		//设置光标位置在第三行第2个字符位
		case 2: lcd12864_set_cursor(3, 1); break;		//设置光标位置在第三行第4个字符位
		case 3: lcd12864_set_cursor(5, 1); break;		//设置光标位置在第三行第6个字符位
		default: break;
	}		
}


/***********************************************************|
| 名称	:| 设置项目左移
| 参数	:| u8 itemMax	-设置项最大个数
| 返回值	:| 无
/***********************************************************/
void item_lMove(u8 itemMax)
{
	if (itemIndex > 1)
	{
		itemIndex--;
	}
	else
	{ 
		itemIndex = itemMax;
	}
	item_select();				//选择设置项
}


/***********************************************************|
| 名称	:| 设置项目右移
| 参数	:| u8 itemMax	-设置项最大个数
| 返回值	:| 无
/***********************************************************/
void item_rMove(u8 itemMax)
{
	if (itemIndex < itemMax)
	{
		itemIndex++;
	}
	else
	{
		itemIndex = 1;
	}
	item_select();				//选择设置项
}


/***********************************************************|
| 名称	:| 左按键程序
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void leftKey()
{
	if (itemIndex != 0)
	{
		switch (arrowPos1)
		{
			case 1:
				switch (arrowPos11)
				{
					case 1: item_lMove(3); break;		//设置时间界面左移
					case 2: item_lMove(3); break;		//设置日期界面左移
					default: break;
				}
				break;
			case 2:
				break;
			default:
				break;		
		}
	}
}


/***********************************************************|
| 名称	:| 右按键程序
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void rightKey()
{
	if (itemIndex != 0)
	{
		switch (arrowPos1)
		{
			case 1:
				switch (arrowPos11)
				{
					case 1: item_rMove(3); break;		//设置时间界面右移
					case 2: item_rMove(3); break;		//设置日期界面右移
					default: break;
				}
				break;
			case 2:
				break;
			default:
				break;		
		}
	}
}


/***********************************************************|
| 名称	:| 刷新时分秒
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void refresh_HMS()
{
	if (itemIndex == 1)
	{
		showDec_byte(1, 1, tmpH);			//每次小时改变后，在屏幕显示出来
		item_select();						//刷新光标位置在第二行第2个字符位
	}
	else if (itemIndex == 2)
	{
		showDec_byte(3, 1, tmpM);			//每次分钟改变后，在屏幕显示出来
		item_select();						//刷新光标位置在第二行第4个字符位
	}
	else if (itemIndex == 3)
	{
		showDec_byte(5, 1, tmpS);			//每次秒数改变后，在屏幕显示出来
		item_select();						//刷新光标位置在第二行第6个字符位
	}
}


/***********************************************************|
| 名称	:| 刷新年月日
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void refresh_YMD()
{
	if (itemIndex == 1)
	{
		showDec_byte(1, 1, tmpY);			//每次年份改变后，在屏幕显示出来
		item_select();						//刷新光标位置在第二行第2个字符位
	}
	else if (itemIndex == 2)
	{
		showDec_byte(3, 1, tmpMh);			//每次月份改变后，在屏幕显示出来
		item_select();						//刷新光标位置在第二行第4个字符位
	}
	else if (itemIndex == 3)
	{
		showDec_byte(5, 1, tmpD);			//每天数改变后，在屏幕显示出来
		item_select();						//刷新光标位置在第二行第6个字符位
	}
}


/***********************************************************|
| 名称	:| 递增小时
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void add_hour()
{	
	if (tmpH < 23)
	{
		tmpH++;
	}
	else
	{
		tmpH = 0;
	}
	refresh_HMS();
}


/***********************************************************|
| 名称	:| 递减小时
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void sub_hour()
{	
	if (tmpH > 0)
	{
		tmpH--;
	}
	else
	{
		tmpH = 23;
	}
	refresh_HMS();
}


/***********************************************************|
| 名称	:| 递增分
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void add_min()
{	
	if (tmpM < 59)
	{
		tmpM++;
	}
	else
	{
		tmpM = 0;
	}
	refresh_HMS();	
}


/***********************************************************|
| 名称	:| 递减分
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void sub_min()
{	
	if (tmpM > 0)
	{
		tmpM--;
	}
	else
	{
		tmpM = 59;
	}
	refresh_HMS();
}


/***********************************************************|
| 名称	:| 递增秒
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void add_sec()
{	
	if (tmpS < 59)
	{
		tmpS++;
	}
	else
	{
		tmpS = 0;
	}
	refresh_HMS();	
}


/***********************************************************|
| 名称	:| 递减秒
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void sub_sec()
{	
	if (tmpS > 0)
	{
		tmpS--;
	}
	else
	{
		tmpS = 59;
	}
	refresh_HMS();
}


/***********************************************************|
| 名称	:| 递增年
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void add_year()
{	
	if (tmpY < 99)
	{
		tmpY++;
	}
	else
	{
		tmpY = 0;
	}
	refresh_YMD();	
}


/***********************************************************|
| 名称	:| 递减年
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void sub_year()
{	
	if (tmpY > 0)
	{
		tmpY--;
	}
	else
	{
		tmpY = 99;
	}
	refresh_YMD();	
}


/***********************************************************|
| 名称	:| 递增月
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void add_month()
{	
	if (tmpY < 12)
	{
		tmpY++;
	}
	else
	{
		tmpY = 0;
	}
	refresh_YMD();	
}


/***********************************************************|
| 名称	:| 递减月
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void sub_month()
{	
	if (tmpY > 0)
	{
		tmpY--;
	}
	else
	{
		tmpY = 12;
	}
	refresh_YMD();	
}


/***********************************************************|
| 名称	:| 递增日
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void add_day()
{	
	if (tmpY < 31)
	{
		tmpY++;
	}
	else
	{
		tmpY = 0;
	}
	refresh_YMD();	
}


/***********************************************************|
| 名称	:| 递减日
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void sub_day()
{	
	if (tmpY > 0)
	{
		tmpY--;
	}
	else
	{
		tmpY = 31;
	}
	refresh_YMD();	
}


/***********************************************************|
| 名称	:| 递增数据
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void add_dat()
{
	switch (arrowPos1)
	{
		case 1:
			switch (arrowPos11)
			{
				case 1:
					switch (itemIndex)
					{
						case 1: add_hour(); break;
						case 2: add_min(); break;
						case 3: add_sec(); break;
						default: break;
					}
					break;
				case 2:
					switch (itemIndex)
					{
						case 1: add_year();  break;
						case 2: add_month(); break;
						case 3: add_day();   break;
						default: break;
					}
					break;
				case 3:
					if (itemIndex == 1)
					{
//						add_week();
					}
					break;
				default:
					break;
			}
			break;
		case 2:
			break;
		default:
			break;
	}
}


/***********************************************************|
| 名称	:| 递减数据
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void sub_dat()
{
	switch (arrowPos1)
	{
		case 1:
			switch (arrowPos11)
			{
				case 1:
					switch (itemIndex)
					{
						case 1: sub_hour(); break;
						case 2: sub_min(); break;
						case 3: sub_sec(); break;
						default: break;
					}
					break;
				case 2:
					switch (itemIndex)
					{
						case 1: sub_year();  break;
						case 2: sub_month(); break;
						case 3: sub_day();   break;
						default: break;
					}
					break;
				case 3:
					if (itemIndex == 1)
					{
//						add_week();
					}
					break;
				default:
					break;
			}
			break;
		case 2:
			break;
		default:
			break;
	}
}


/***********************************************************|
| 名称	:| 保存数据
| 参数	:| 无
| 返回值	:| 无
/***********************************************************/
void save_dat()
{
	switch (arrowPos1)
	{
		case 1:
			switch (arrowPos11)
			{
				case 1:
					switch (itemIndex)
					{
						case 1: cntH = tmpH; break;		//保存小时设置
						case 2: cntM = tmpM; break;		//保存小时分钟		
						case 3: cntS = tmpS; break;		//保存小时秒数
						default: break;
					}					
					break;
				case 2:
					switch (itemIndex)
					{
						case 1: year  = tmpY;  break;	//保存年份设置
						case 2: month = tmpMh; break;	//保存月份设置
						case 3: day   = tmpD;  break;	//保存日设置
						default: break;
					}
					break;
				case 3:
					if (itemIndex == 1)
					{
//						add_week();
					}
					break;
				default:
					break;
			}
			break;
		case 2:
			break;
		default:
			break;
	}
	rightKey();
}